In [11]:
#separate positive and negative comments
positive = ['good','awesome', 'best', 'nice']
negative = ['worst','awful', 'bad']

tweets = ['This government policies are good', 'bad implementation', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', 'The wine tastes awful', "It's nice to hear this little kid's laugh"]

positive = [x for x in tweets for y in x.split() if y in positive]
negative = [x for x in tweets for y in x.split() if y in negative]
print(positive)
print(negative)

['This government policies are good', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', "It's nice to hear this little kid's laugh"]
['bad implementation', 'The wine tastes awful']

In [14]:
a="hellooooo"
b="hello"
print(b in a)

True

In [21]:
filter_list=[1,2,3,"a","b","@",5,10,12,"Nothing","Here","34","343"]
[x for x in filter_list if type(x)==int]

[1, 2, 3, 5, 10, 12]

In [23]:
def filterIt(l):
    output=[]
    for i in l:
        if type(i) !=str:
            output.append(i)
    return output

filterIt(filter_list)

[1, 2, 3, 5, 10, 12]

In [31]:
def inverse(string):
    ans=""
    for i in string:
        if str.isupper(i):
            ans=i.lower()+ans
        else:
            ans=i.upper()+ans
        
    return ans


inverse("Hello World")

'DLROw OLLEh'

In [32]:
string="How are YOu"
print(string.swapcase()[::-1]);

Uoy ERA WOh

In [35]:
datesList=['17-12-1997','22-05-2011','01-05-1993','19-06-2020']

[x[-4:] for x in datesList]

['1997', '2011', '1993', '2020']

In [38]:
names=['santa Maria','Hello World','Merry Christmas','tHank You']

[y for x in names for y in x.split() if y.istitle()]

['Maria', 'Hello', 'World', 'Merry', 'Christmas', 'You']

In [5]:
#python in class 20th
import pandas as pd
df=pd.DataFrame({'Id':[1,2,3,4],'Name':['Mia','Sara','Joey','Karan'],'Age':[47,38,48,41],'Gender':[1,1,0,0]})
df

   Id   Name  Age  Gender
0   1    Mia   47       1
1   2   Sara   38       1
2   3   Joey   48       0
3   4  Karan   41       0

In [6]:
place_value={1:'Female' ,0:'Male'}
df['Gender']=df['Gender'].map(place_value)
df

   Id   Name  Age  Gender
0   1    Mia   47  Female
1   2   Sara   38  Female
2   3   Joey   48    Male
3   4  Karan   41    Male